---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ConstantHeightNotParallel
source: html/2fe0ab1a-cde7-bcc7-307e-b2dba452bda5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ConstantHeightNotParallel Property

Constant-height-defining lines must be parallel.

## Syntax (C#)
```csharp
public static FailureDefinitionId ConstantHeightNotParallel { get; }
```